[
  {
    "title": "Twenty Thousand Leagues Under the Seas",
    "summary": "Professor Aronnax, his servant Conseil, and harpooner Ned Land are taken aboard Captain Nemo's advanced submarine, the Nautilus. They explore the world's oceans, discovering wonders and dangers beneath the surface. Themes include exploration, science, isolation, and moral conflict.",
    "full_summary": "In Jules Verne's classic, Professor Aronnax, Conseil, and Ned Land are captured after encountering a mysterious sea creature, which turns out to be Captain Nemo's submarine, the Nautilus. Over months of undersea travel, they witness coral kingdoms, shipwrecks, the Antarctic ice, and the lost city of Atlantis. Nemo is revealed as both a genius and a man tormented by grief and hatred for imperial powers. While they marvel at the wonders of the ocean, the crew also experiences danger from giant squids and hostile navies. Ultimately, the trio attempts an escape, leaving Nemo's fate uncertain. The novel blends adventure with deep reflections on freedom, isolation, and the ethics of science."
  },
  {
    "title": "Around the World in Eighty Days",
    "summary": "Phileas Fogg wagers he can travel around the globe in just 80 days. Accompanied by his valet Passepartout, he faces delays, dangers, and a detective convinced he is a criminal. Themes include adventure, time, friendship, and ingenuity.",
    "full_summary": "Phileas Fogg, an English gentleman obsessed with punctuality, bets his fellow club members £20,000 that he can circumnavigate the globe in 80 days. With his loyal servant Passepartout, he embarks on a journey that takes them across oceans, through deserts, and into unexpected trouble. Their progress is hindered by storms, broken transport links, and the relentless pursuit of Detective Fix, who mistakenly believes Fogg is a bank robber. Along the way, Fogg saves Aouda, a woman in peril, who later joins them. In a twist ending, Fogg wins the bet with moments to spare, realizing that love, not punctuality, has brought him his greatest reward."
  },
  {
    "title": "Journey to the Center of the Earth",
    "summary": "Professor Lidenbrock, his nephew Axel, and their guide Hans venture deep underground to reach the Earth's core. They encounter vast caverns, prehistoric creatures, and subterranean seas. Themes include exploration, courage, and the limits of human knowledge.",
    "full_summary": "After decoding a mysterious runic manuscript, Professor Otto Lidenbrock becomes convinced it contains directions to reach the Earth's center. He drags his reluctant nephew Axel on an expedition to Iceland, where they descend into a dormant volcano with their guide Hans. Underground, they discover a vast world of giant mushrooms, prehistoric reptiles, and an underground ocean. They survive volcanic eruptions, storms, and near starvation before being expelled back to the surface. The novel combines scientific speculation with thrilling adventure, exploring humanity’s insatiable curiosity and bravery in the face of the unknown."
  },
  {
    "title": "From the Earth to the Moon",
    "summary": "A post-Civil War artillery club attempts to launch a projectile to the Moon. Their ambitious project blends engineering challenges with national pride. Themes include scientific progress, ambition, and human ingenuity.",
    "full_summary": "In the aftermath of the American Civil War, the Baltimore Gun Club seeks a new challenge and decides to send a projectile to the Moon. Led by Impey Barbicane, they design an enormous cannon capable of achieving the feat. Rivalries and debates arise, particularly with Captain Nicholl, a skeptic of the plan. Unexpectedly, French adventurer Michel Ardan proposes that humans travel inside the projectile. The launch becomes a global spectacle, and the book ends on a cliffhanger as the projectile soars into space. The novel mixes humor, technical detail, and the spirit of discovery characteristic of Verne's work."
  },
  {
    "title": "The Mysterious Island",
    "summary": "Shipwrecked castaways use ingenuity and science to survive on an uncharted island. Strange occurrences hint at a hidden benefactor. Themes include survival, friendship, and the application of knowledge.",
    "full_summary": "A group of Union prisoners escape the American Civil War by hot air balloon, only to be blown off course and stranded on a remote island. Led by engineer Cyrus Smith, they build shelter, domesticate animals, and create tools using scientific principles. Mysterious events—rescued castaways, sudden supplies, and protection from danger—suggest the presence of an unknown helper. Eventually, they discover their benefactor is Captain Nemo, living out his final days in the Nautilus hidden beneath the island. As a volcanic eruption destroys their refuge, they are rescued, closing a story of resilience, camaraderie, and the triumph of human ingenuity."
  },
  {
    "title": "Crime and Punishment",
    "summary": "Raskolnikov, a destitute student, murders a pawnbroker and spirals into guilt and paranoia. Themes include morality, redemption, and the psychology of crime.",
    "full_summary": "Rodion Raskolnikov, a poor ex-student in St. Petersburg, kills a pawnbroker he considers a parasite, partly to test his theory that extraordinary individuals can bypass moral laws. Haunted by guilt and pursued by the astute investigator Porfiry, Raskolnikov becomes entangled with Sonia, a compassionate woman whose moral strength contrasts with his turmoil. As his mental state deteriorates, he confesses and is sentenced to Siberia. Sonia follows him, offering hope for redemption. Dostoevsky’s masterpiece delves deep into the nature of conscience, the struggle between pride and humility, and the path to spiritual renewal."
  },
  {
    "title": "The Brothers Karamazov",
    "summary": "Three brothers face moral and spiritual dilemmas after their tyrannical father's murder. Themes include faith, doubt, free will, and responsibility.",
    "full_summary": "Set in 19th-century Russia, the story follows the Karamazov brothers—Dmitri, passionate and impulsive; Ivan, intellectual and skeptical; and Alyosha, gentle and devout. Their father, Fyodor, is a corrupt and abusive man. When Fyodor is murdered, suspicion falls on Dmitri, though others may be guilty. The novel interweaves philosophical debates about God, morality, and human freedom with a tense family drama. Through courtroom scenes, confessions, and moral crises, Dostoevsky explores the deepest questions of faith, justice, and the human soul."
  },
  {
    "title": "Notes from Underground",
    "summary": "An unnamed narrator delivers a bitter monologue on society and human nature, rejecting rational utopias. Themes include alienation, freedom, and self-destruction.",
    "full_summary": "The novella is divided into two parts: in the first, the 'Underground Man' rails against the false promises of rationalism and the idea that human behavior can be scientifically predicted. In the second, he recounts episodes from his life, revealing patterns of spite and self-sabotage. His interactions with former classmates, a dinner party, and a young prostitute named Liza expose his inability to connect meaningfully with others. The work is a psychological portrait of isolation and contradiction, challenging the optimism of 19th-century progressivism."
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "summary": "Harry Potter, an orphan who discovers he is a wizard, attends Hogwarts School of Witchcraft and Wizardry. With friends Ron and Hermione, he uncovers the secret of the Philosopher's Stone. Themes include friendship, courage, and the battle between good and evil.",
    "full_summary": "On his eleventh birthday, Harry Potter learns from the giant Hagrid that he is a wizard. Enrolling at Hogwarts, Harry befriends Ron Weasley and Hermione Granger, and discovers the magical world filled with wonders and dangers. As the trio navigates their first year, they uncover the mystery of the Philosopher's Stone, a magical object granting immortality. They face magical trials, confront the dark wizard Voldemort, and ultimately prevent him from returning to power. The novel combines adventure, friendship, and moral choices in a richly imagined magical world."
  },
  {
    "title": "Pride and Prejudice",
    "summary": "Elizabeth Bennet navigates issues of manners, morality, and marriage in early 19th-century England. Themes include love, social class, and personal growth.",
    "full_summary": "Elizabeth Bennet, one of five daughters in a modest family, meets the wealthy and aloof Mr. Darcy. Initial misunderstandings and social prejudices keep them apart, while other romantic entanglements create tension. Over time, Elizabeth recognizes Darcy's integrity, and Darcy overcomes his pride. Through witty dialogue and social observation, Jane Austen crafts a love story that critiques rigid class structures and champions self-awareness and mutual respect."
  }
]
